ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f70eac4-2b8c-4400-9fb7-f3d4230ad33e">
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3c31986-dede-48b5-9cc7-1c35e4fb81f6">
    <name>ПродажаПоПатенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1270ac55-6965-4dae-b63b-1266cf1cca2a">
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/CommonModules/рвк_ОбщийМодульПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Налогообложение НДС.
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Партнер - СправочникСсылка.Партнеры
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыНалогообложенияНДС - Налогообложение НДС
Функция НалогообложениеНДС(Организация, Партнер) Экспорт
	Перем Результат;

	НаименованиеПартнера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Наименование");
	ОрганизацияИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
	ОрганизацияИП = ОрганизацияИНН = "772161119773";
	ПартнерЧастноеЛицо = СтрНачинаетсяС(НаименованиеПартнера, "Частное лицо");
	Если ОрганизацияИП И ПартнерЧастноеЛицо Тогда
		Результат = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту;
	ИначеЕсли ОрганизацияИП И НЕ ПартнерЧастноеЛицо Тогда
		Результат = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	Иначе
		Результат = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Партнер - наша организация.
//
// Параметры:
//  Партнер - СправочникСсылка.Партнеры
//
// Возвращаемое значение:
//  Булево
Функция ПартнерНашаОрганизация(Партнер) Экспорт

	ИмяСвойста = "ЭтоНашаОрганизация_f3674409091449fe9648a780ea00ab03";
	Результат = рвк_ОбщегоНазначения.ЗначениеСвойства(Партнер, ИмяСвойста, Ложь);

	Возврат Результат;

КонецФункции

// Создавать счетфактур автоматически.
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//
// Возвращаемое значение:
//  Булево
Функция СоздаватьСчетфактурАвтоматически(Организация) Экспорт

	ИмяСвойста = "СоздаватьСчетфактурАвтоматически_8ca57267cf054884a995902e23783f85";
	Результат = рвк_ОбщегоНазначения.ЗначениеСвойства(Организация, ИмяСвойста, Ложь);

	Возврат Результат;

КонецФункции

Функция АдресПолучателейОшибокЖР() Экспорт
	Возврат Константы.рвк_АдресПолучателяОшибокЖР.Получить();
КонецФункции

#КонецОбласти
